Полигон/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccountingRegister.Корреспонденция</registerRecords>
  <registerRecords>AccountingRegister.БезКорреспонденции</registerRecords>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Полигон/src/AccountingRegisters/Корреспонденция/Корреспонденция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Корреспонденция</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Управленческий.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</accountingFlag>
  </resources>
</mdclass:AccountingRegister>

Полигон/src/AccountingRegisters/БезКорреспонденции/БезКорреспонденции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>БезКорреспонденции</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Управленческий.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</accountingFlag>
  </resources>
</mdclass:AccountingRegister>

Полигон/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
    </items>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные средства</description>
      <code>50</code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчеты с поставщиками</description>
      <code>60</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСПокупателями</name>
      <description>Расчеты с покупателями</description>
      <code>62</code>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>90.01</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Расходы</name>
        <description>Расходы</description>
        <code>90.02</code>
      </childItems>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Полигон/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Номенклатура</types>
  </type>
  <predefined>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Полигон/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Корреспонденция.Очистить();
	Движения.Корреспонденция.Записывать  = Истина;
	Движения.Записать();
	
	Выборка = ПолучитьВыборкуДляФормированияДвижения();
	
	Движения.Корреспонденция.Записывать = Истина;
	Движения.БезКорреспонденции.Записывать = Истина;

	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > Выборка.КоличествоОстаток Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			ТекстСообщения = "Не хватает товара %1. Необходимо %2, в наличии %3.";
			Сообщение.Текст = СтрШаблон(ТекстСообщения, 
										Выборка.Номенклатура, 
										Выборка.Количество, 
										Выборка.КоличествоОстаток);
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Поле = "Товары[" + (Выборка.НомерСтроки - 1) +"].Количество";
			Сообщение.Сообщить(); 
			Продолжить;
		КонецЕсли;  
		
		СформироватьДвиженияПоНоменклатуре(Выборка);
		
	КонецЦикла; 
	
КонецПроцедуры

Функция ПолучитьВыборкуДляФормированияДвижения()
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	               |	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
	               |	МИНИМУМ(РеализацияТоваровУслугТовары.НомерСтроки) КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура,
	               |	ВТ_ДанныеДокумента.Количество КАК Количество,
	               |	ВТ_ДанныеДокумента.Сумма КАК Сумма,
	               |	ЕСТЬNULL(КорреспонденцияОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(КорреспонденцияОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	               |	ВТ_ДанныеДокумента.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Корреспонденция.Остатки(
	               |				&ДатаДокумента,
	               |				Счет = &Товары,
	               |				,
	               |				Субконто2 В
	               |						(ВЫБРАТЬ
	               |							ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура
	               |						ИЗ
	               |							ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)
	               |					И Субконто1 = &Склад) КАК КорреспонденцияОстатки
	               |		ПО ВТ_ДанныеДокумента.Номенклатура = КорреспонденцияОстатки.Субконто2";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Товары", ПланыСчетов.Управленческий.Товары);
	Запрос.УстановитьПараметр("ДатаДокумента", МоментВремени()); 
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Возврат Выборка;
	
КонецФункции

Процедура СформироватьДвиженияПоНоменклатуре(Выборка)
	
	Если Выборка.Количество = Выборка.КоличествоОстаток Тогда
		Себестоимость = Выборка.СуммаОстаток;
	Иначе
		Себестоимость = Выборка.СуммаОстаток * Выборка.Количество / Выборка.КоличествоОстаток;
	КонецЕсли;
	
		Движение = Движения.Корреспонденция.Добавить();
		Движение.СчетДт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
		Движение.СчетКт = ПланыСчетов.Управленческий.Товары;
		Движение.Период = Дата;
		Движение.Сумма = Себестоимость;
		Движение.КоличествоКт = Выборка.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
		
		Движение = Движения.Корреспонденция.Добавить();
		Движение.СчетДт = ПланыСчетов.Управленческий.РасчетыСПокупателями;
		Движение.СчетКт = ПланыСчетов.Управленческий.Выручка;
		Движение.Период = Дата;
		Движение.Сумма = ВЫборка.Сумма - Себестоимость;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;	
		
		Движение = Движения.БезКорреспонденции.Добавить();
		Движение.ВидДвижения = ВидДвиженияБухгалтерии.Кредит;
		Движение.Счет = ПланыСчетов.Управленческий.Товары;
		Движение.Период = Дата;
		Движение.Сумма = Себестоимость;
		Движение.Количество = Выборка.Количество;
		Движение.Субконто[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
		Движение.Субконто[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
		
		Движение = Движения.БезКорреспонденции.Добавить();
		Движение.ВидДвижения = ВидДвиженияБухгалтерии.Кредит;
		Движение.Счет = ПланыСчетов.Управленческий.Выручка;
		Движение.Период = Дата;
		Движение.Сумма = Выборка.Сумма - Себестоимость;
		
		Движение = Движения.БезКорреспонденции.Добавить();
		Движение.ВидДвижения = ВидДвиженияБухгалтерии.Дебет;
		Движение.Счет = ПланыСчетов.Управленческий.РасчетыСПокупателями;
		Движение.Период = Дата;
		Движение.Сумма = Выборка.Сумма;
		Движение.Субконто[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
				
КонецПроцедуры
